Revit 2027 API
ParameterTypeId.ThermalMaterialSpecificHeatCapacity Property
 "Specific Heat Capacity"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ThermalMaterialSpecificHeatCapacity { get; }
Public Shared ReadOnly Property ThermalMaterialSpecificHeatCapacity As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ThermalMaterialSpecificHeatCapacity {
	ForgeTypeId^ get ();
}
static member ThermalMaterialSpecificHeatCapacity : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace